slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Introduction to Functional Programming</title>
<meta name="author" content="(Bill Carlson)"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/css/theme/sky.css" id="theme"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-orgbf7de81">
<h2 id="orgbf7de81">Introduction to Functional Programming</h2>

</section>
</section>
<section>
<section id="slide-org94b495a">
<h2 id="org94b495a">Inspiration</h2>
<p>
I've stolen this presentation before, and I'll do it again
</p>

<p>
<a href="https://www.youtube.com/watch?v=aAtPi23nLcw">Runar Bjarnasson - Introduction to Functional Programming</a>
</p>

</section>
</section>
<section>
<section id="slide-org6590ef6">
<h2 id="org6590ef6">Who am I?</h2>
<ul>
<li>Bill Carlson</li>
<li>Senior Software Engineer @ Banno</li>
<li>I get paid to write purely functional programs</li>
<li>Proud graduate of the National Champion University of Virginia</li>

</ul>
<aside class="notes">
<p>
for a few years now!
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgb91dcde">
<h2 id="orgb91dcde">What is Functional Programming?</h2>
<p class="fragment">
Programming with functions
</p>

</section>
<section id="slide-org91d32a7">
<h3 id="org91d32a7">What is a function?</h3>
<p class="fragment">
A function <code>f :: A -&gt; B</code> maps <b>any</b> value from A to <b>exactly one</b> value in B
</p>

<p class="fragment">
<i>And nothing else</i>
</p>

</section>
<section id="slide-orgdcf25ce">
<h3 id="orgdcf25ce">What does that mean?</h3>
<dl>
<dt>Totality</dt><dd>A function will return a single value for all values of <code>A</code>.</dd>
<dt>Determinism</dt><dd>Every time you call a function with the same arguments, you will <i>always</i> get the same result.</dd>
<dt>Purity</dt><dd>The output of the function is the <i>only</i> effect.</dd>

</dl>


</section>
<section id="slide-org075eeba">
<h3 id="org075eeba">What does <i>that</i> mean?</h3>
<p>
A function can not:
</p>
<ul>
<li>Read/Write to disk</li>
<li>Print to the console</li>
<li>Query a database</li>
<li>Throw an exception</li>
<li>Check the system clock</li>
<li>etc.</li>

</ul>

<p>
But we'll touch on that later&#x2026;
</p>

</section>
<section id="slide-org4318b62">
<h3 id="org4318b62">Referential Tranparency</h3>
<ul>
<li>You can replace all occurrences of an expression with the result of that call without changing the program.</li>
<li>A function <code>f(a)</code> is pure if it is referentially transparent for all referentially transparent values of <code>a</code></li>

</ul>

</section>
<section id="slide-org346d2ba">
<h4 id="org346d2ba">Example</h4>
<div class="org-src-container">

<pre><code class="scala" >val string = "some text"
val e1 = string.reverse
val e2 = string.reverse
val e3 = e1 + e2
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="scala" >val buffer = new StringBuilder("some text")
val n1 = buffer.reverse
val n2 = buffer.reverse
val n3 = n1.append(n2)
</code></pre>
</div>

</section>
<section id="slide-orgeb308a3">
<h4 id="orgeb308a3">Referential Transparency</h4>
<ul>
<li>A functional program is not a set of instructions for the computer.</li>
<li>It is a single referentially transparent expression.</li>
<li>Running a program is just a series of reductions to a single value.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgb3ab549">
<h2 id="orgb3ab549">Live Coding</h2>
<aside class="notes">
<p>
Since this is a combination of Elixir and Java meetups, with folks
likely being able to read OO-style coding, and most everyone is likely
to be able to at least decipher something like Ruby&#x2026;
</p>

</aside>

</section>
<section id="slide-org6e3bf88">
<h3 id="org6e3bf88">Haskell</h3>
<aside class="notes">
<p>
Why Haskell? Because Haskell is the lingua franca of functional
programming. It is the closest to the lambda calculus that acts as the
theoretical underpinnings of FP.  So, let's take a look&#x2026;
</p>

<p>
Remember to ask questions!
</p>

</aside>

</section>
<section id="slide-org6daecf8">
<h4 id="org6daecf8">Function calls</h4>
<div class="org-src-container">

<pre><code class="haskell" >-- type declaration
inc :: Integer -> Integer
^      ^          ^
name   param      return

-- expression declaration
inc   x   =   x + 1
^     ^       ^
name  param   expression (implicit return)

</code></pre>
</div>

</section>
<section id="slide-org7c0ad5c">
<h4 id="org7c0ad5c">Multiple parameters</h4>
<div class="org-src-container">

<pre><code class="haskell" >-- type declaration
add :: Integer -> Integer -> Integer
^      ^          ^          ^
name   param      param      return

-- expression declaration
inc   x      y       =   x + y
      ^      ^           ^
name  param  param       expression

</code></pre>
</div>

</section>
<section id="slide-orgd443785">
<h4 id="orgd443785">Calling functions</h4>
<div class="org-src-container">

<pre><code class="haskell" >-- Calling with all known parameters
x = add 2 3 -- x == 5

-- Curried functions
addTwo :: Integer -> Integer
addTwo = add 2

y = addTwo 3 -- y == 3
</code></pre>
</div>

</section>
<section id="slide-orga7cae91">
<h4 id="orga7cae91">Lambdas</h4>
<div class="org-src-container">

<pre><code class="haskell" >inc :: Int -> Int

inc = \x -> x + 1
</code></pre>
</div>

<aside class="notes">
<p>
First, let's look at how to build a type
</p>

<p>
data Bool = True | False
</p>

<p>
And then define a quick function (note pattern matching)
</p>

<p>
not :: Bool -&gt; Bool
not True = False
not False = True
</p>

<p>
even :: Integer -&gt; Bool
even n = mod n 2 == 0
</p>

<p>
&#x2013; Return true if the second integer is divisible by the first integer
divisibleBy :: Integer -&gt; Integer -&gt; Bool
divisibleBy k n = mod n k <code>= 0
divisibleBy' k = \n -&gt; mod n k =</code> 0
&#x2013; divisibleBy'' k = (== 0) . flip (mod)
</p>

<p>
even' = divisibleBy 2
&#x2013; Function composition: (f ∘ g)(x) == f(g(x))
&#x2013; f :: b -&gt; c ; g :: a -&gt; b ; (f ∘ g) :: a -&gt; c
&#x2013; :t (.)
odd   = not . even'
</p>

</aside>

</section>
<section id="slide-orgfe6b6c1">
<h4 id="orgfe6b6c1">Higher-order functions</h4>
<ul>
<li>Functions are values</li>
<li>Values can be passed to or returned from functions</li>
<li>Ergo, functions can accept and return functions</li>

</ul>

<aside class="notes">
<p>
&#x2013; Lifting
and :: Pred a -&gt; Pred a -&gt; Pred a
and p1 p2 = \a -&gt; (p1 a) &amp;&amp; (p2 a)
or :: Pred a -&gt; Pred a -&gt; Pred a
or p1 p2 = \a -&gt; (p1 a) || (p2 a)
&#x2013; Copy/paste is awful - let's try to abstract
lift :: (Bool -&gt; Bool -&gt; Bool) &#x2013; f
     -&gt; Pred a &#x2013; b1
     -&gt; Pred a &#x2013; b2
     -&gt; Pred a &#x2013; result
lift f b1 b2 = \a -&gt; f (b1 a) (b2 a)
</p>

<p>
and' :: Pred a -&gt; Pred a -&gt; Pred a
and' = lift (&amp;&amp;)
</p>

<p>
or' :: Pred a -&gt; Pred a -&gt; Pred a
or' = lift (||)
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgec42aeb">
<h2 id="orgec42aeb">Data Structures</h2>
<div class="outline-text-2" id="text-orgec42aeb">
</div>
</section>
<section id="slide-orgde71cb7">
<h4 id="orgde71cb7">List</h4>
<div class="org-src-container">

<pre><code class="haskell" >data List a = Nil | Cons a (List a)
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="haskell" >data [a] = [] | a : [a]
</code></pre>
</div>

</section>
<section id="slide-org3ede55c">
<h4 id="org3ede55c">List</h4>
<ul>
<li>Build a large list by prepending to a smaller list</li>

</ul>
<div class="org-src-container">

<pre><code class="haskell" >small_list = [4, 3, 2, 1]
bigger_list = 8 : 7 : 6 : 5 : small_list
</code></pre>
</div>
<ul>
<li>This does not change the value of <code>small_list</code></li>
<li>This <i>shares</i> the space used by <code>small_list</code></li>

</ul>

</section>
<section id="slide-org9d9ae6f">
<h4 id="org9d9ae6f">Reduction</h4>
<ul>
<li>Building lists is all well and good, but how can we get an actual value out of it?</li>
<li>Let's look at summing a list of <code>Integer</code> values</li>
<li>MORE CODE!!</li>

</ul>

<aside class="notes">
<p>
&#x2013;
&#x2013; Lists
&#x2013;
sum :: [Integer] -&gt; Integer
sum [] = 0
sum (x:xs) = x + sum xs
</p>

<p>
product :: [Integer] -&gt; Integer
product [] = 1
product (x:xs) = x * product xs
</p>

<p>
foldright :: (a -&gt; b -&gt; b)
          -&gt; b
          -&gt; [a]
          -&gt; b
foldright _ z []     = z
foldright f z (x:xs) = f x (foldright f z xs)
</p>

<p>
sumr' :: [Integer] -&gt; Integer
sumr' = foldright (+) 0
</p>

<p>
&#x2013; foldright (<del>) 0 [1, 2, 3, 4]
&#x2013; 1 + (foldright (</del>) [2, 3, 4])
&#x2013; 1 + 2 + (foldright (<del>) [3, 4])
&#x2013; 1 + 2 + 3 + (foldright (</del>) [4])
&#x2013; 1 + 2 + 3 + 4 + (foldright (+) [])
&#x2013; 1 + 2 + 3 + 4 + 0
&#x2013; 1 + 2 + 3 + 4
&#x2013; 1 + 2 + 3
&#x2013; 1 + 2
&#x2013; 1
</p>

<p>
&#x2013; (1 + (2 + (3 + (4 + 0))))
</p>

<p>
product' :: [Integer] -&gt; Integer
product' = foldright (*) 1
</p>

<p>
suml :: [Integer] -&gt; Integer
suml xs = go xs 0
  where
    go :: [Integer] -&gt; Integer -&gt; Integer
    go [] accum = accum
    go (x:xs) accum = go xs (x + accum)
</p>

<p>
foldleft :: (b -&gt; a -&gt; b)
         -&gt; b
         -&gt; [a]
         -&gt; b
foldleft f z xs = go xs z
  where go [] accum = accum
        go (y:ys) accum = go ys (f accum y)
</p>


<p>
&#x2013; foldleft (+) 0 [1, 2, 3, 4]
&#x2013; go [1, 2, 3, 4] 0
&#x2013; go [2, 3, 4] 1
&#x2013; go [3, 4] 3
&#x2013; go [4] 6
&#x2013; go [] 10
&#x2013; 10
</p>

<p>
&#x2013; ((((0 + 1) + 2) + 3) + 4)
</p>


<p>
reverse :: [a] -&gt; [a]
reverse = foldleft (flip (:)) []
&#x2013; :t (:)       :: a -&gt; [a] -&gt; [a]
&#x2013; :t flip (:)  :: [a] -&gt; a -&gt; [a]
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgf3516e4">
<h2 id="orgf3516e4">Error Handling</h2>
<div class="outline-text-2" id="text-orgf3516e4">
</div>
</section>
<section id="slide-org7a6ebdb">
<h4 id="org7a6ebdb">Maybe</h4>
<p>
<code>data Maybe a = Nothing | Just a</code>
</p>

<aside class="notes">
<p>
headsafe :: [a] -&gt; Maybe a
headsafe [] = Nothing
headsafe (x:xs) = Just x
</p>

<p>
foldMaybe :: b -&gt; (a -&gt; b) -&gt; Maybe a -&gt; b
foldMaybe z _ Nothing  = z
foldMaybe _ f (Just a) = f a
</p>

</aside>

</section>
<section id="slide-org73feaef">
<h4 id="org73feaef">Either</h4>
<p>
<code>data Either a b = Left a | Right b</code>
</p>

<aside class="notes">
<p>
headsafe' :: [a] -&gt; Either String a
headsafe' [] = Left "Can't take head of an empty list"
headsafe' (x:xs) = Right x
</p>

<p>
foldEither :: (a -&gt; c) -&gt; (b -&gt; c) -&gt; Either a b -&gt; c
foldEither l _ (Left a)  = l a
foldEither _ f (Right b) = f b
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org5db3410">
<h2 id="org5db3410">Effects</h2>
<ul>
<li>Rather than executing the effects, create a data structure that
defines <i>how</i> to execute the effects.</li>
<li>At the end of the world, do the dirty work.</li>
<li>This is codified in Haskell using the <code>IO</code> type</li>

</ul>

</section>
<section id="slide-org9f3b2ef">
<h4 id="org9f3b2ef">Live Code</h4>
<p class="fragment">
Maybe next time
</p>

</section>
</section>
<section>
<section id="slide-org11b3194">
<h2 id="org11b3194">Summary</h2>
<ul>
<li>A program is a referentially transparent expression
<ul>
<li>Provides testability and safety</li>

</ul></li>
<li>Build data structures to transform data</li>
<li>Interpret data structures using fold, or some derivative</li>
<li>Run effects at the end of the world</li>

</ul>

</section>
</section>
<section>
<section id="slide-org291537f">
<h2 id="org291537f">Resources</h2>
<dl>
<dt>Haskell Programming from First Principles</dt><dd><a href="http://haskellbook.com">http://haskellbook.com</a></dd>
<dt>Functional Programming in Scala</dt><dd><a href="https://www.manning.com/books/functional-programming-in-scala">https://www.manning.com/books/functional-programming-in-scala</a></dd>

</dl>

</section>
</section>
<section>
<section id="slide-orgaf33cf5">
<h2 id="orgaf33cf5">?</h2>
</section>
</section>
<section>
<section id="slide-orgb631768">
<h2 id="orgb631768">Thank you</h2>
</section>
</section>
</div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/lib/js/head.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
